/*
 * 创建一个线性表
 */
var table = [];

/*
 * 增
 */
table.push(1); // 结尾加上元素1   ->  [ 1 ]
table.push(5); // 结尾加上元素5   ->  [ 1, 5 ]
table.unshift(3); // 开头加上元素3 -> [ 3, 1, 5 ]
table.unshift(8); // 开头加上元素8 -> [ 8, 3, 1, 5 ]
table.splice(1, 0, 12, 6); // 从索引1的地方插入12, 6 -> [ 8, 12, 6, 3, 1, 5 ]

/*
 * 删
 */
table.pop(); // 删除结尾元素 -> [ 8, 12, 6, 3, 1 ]
table.shift(); // 删除开头元素 -> [ 12, 6, 3, 1 ]
table.splice(1, 1); // 删除索引1处删除1个元素 -> [ 12, 3, 1 ]

/*
 * 改
 */
table[0] = 8; // -> [ 8, 3, 1 ]
table[2] = 2; // -> [ 8, 3, 2 ]

/*
 * 查
 */
console.log(table); // [ 8, 3, 1 ]
console.log(table[1]); // 3
